In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
from matplotlib import pyplot as plt

In [2]:
#https://www.kaggle.com/datasets/ruchi798/data-science-job-salaries

In [3]:
df1 = pd.read_csv('ds_salaries.csv')

In [4]:
df1.head()

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L

In [5]:
df1.columns

Index(['Unnamed: 0', 'work_year', 'experience_level', 'employment_type',
       'job_title', 'salary', 'salary_currency', 'salary_in_usd',
       'employee_residence', 'remote_ratio', 'company_location',
       'company_size'],
      dtype='object')

In [6]:
df2 = df1.drop(columns=['Unnamed: 0'],axis='columns')

In [7]:
df2.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L

In [8]:
df2.tail()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
602,2022,SE,FT,Data Engineer,154000,USD,154000,US,100,US,M
603,2022,SE,FT,Data Engineer,126000,USD,126000,US,100,US,M
604,2022,SE,FT,Data Analyst,129000,USD,129000,US,0,US,M
605,2022,SE,FT,Data Analyst,150000,USD,150000,US,100,US,M
606,2022,MI,FT,AI Scientist,200000,USD,200000,IN,100,US,L

## Dataset columns description

work_year - The year the salary was paid.

experience_level : The experience level in the job during the year with the following possible values: EN = Entry-level / Junior MI = Mid-level / Intermediate SE = Senior-level / Expert EX = Executive-level / Director

employment_type - The type of employement for the role: PT = Part-time FT = Full-time CT = Contract FL = Freelance

job_title - The role worked in during the year.

salary - The total gross salary amount paid.

salary_currency - The currency of the salary paid as an ISO 4217 currency code.

salary_in_usd - The salary in USD (FX rate divided by avg. USD rate for the respective year via fxdata.foorilla.com).

employee_residence - Employee's primary country of residence in during the work year as an ISO 3166 country code(Alpha-2 code).

remote_ratio - The overall amount of work done remotely, possible values are as follows: 0 = No remote work (less than 20%) 50 = Partially remote 100 = Fully remote (more than 80%)

company_location - The country of the employer's main office or contracting branch as an ISO 3166 country code(Alpha-2 code).

company_size - The average number of people that worked for the company during the year: S = less than 50 employees (small) M = 50 to 250 employees (medium) L = more than 250 employees (large)

In [9]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 607 entries, 0 to 606
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           607 non-null    int64
 1   experience_level    607 non-null    object
 2   employment_type     607 non-null    object
 3   job_title           607 non-null    object
 4   salary              607 non-null    int64
 5   salary_currency     607 non-null    object
 6   salary_in_usd       607 non-null    int64
 7   employee_residence  607 non-null    object
 8   remote_ratio        607 non-null    int64
 9   company_location    607 non-null    object
 10  company_size        607 non-null    object
dtypes: int64(4), object(7)
memory usage: 52.3+ KB

In [10]:
df2.isnull().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [11]:
df2.describe()

         work_year        salary  salary_in_usd  remote_ratio
count   607.000000  6.070000e+02     607.000000     607.00000
mean   2021.405272  3.240001e+05  112297.869852      70.92257
std       0.692133  1.544357e+06   70957.259411      40.70913
min    2020.000000  4.000000e+03    2859.000000       0.00000
25%    2021.000000  7.000000e+04   62726.000000      50.00000
50%    2022.000000  1.150000e+05  101570.000000     100.00000
75%    2022.000000  1.650000e+05  150000.000000     100.00000
max    2022.000000  3.040000e+07  600000.000000     100.00000

## Data Preprocessing

In [12]:
df2.shape

(607, 11)

In [13]:
df2.duplicated().sum()

42

In [14]:
df2.drop_duplicates(inplace=True)

In [15]:
df2.shape

(565, 11)

In [16]:
df2['experience_level'].value_counts()

SE    243
MI    208
EN     88
EX     26
Name: experience_level, dtype: int64

In [17]:
df2['experience_level'] = df2['experience_level'].map({
                            'SE': 'Senior',
                            'MI': 'Mid',
                            'EN': 'Entry',
                            'EX': 'Executive'
                        })

In [18]:
df2['experience_level'].value_counts()

Senior       243
Mid          208
Entry         88
Executive     26
Name: experience_level, dtype: int64

In [19]:
df2['employment_type'].value_counts()

FT    546
PT     10
CT      5
FL      4
Name: employment_type, dtype: int64

In [20]:
df2['employment_type'] = df2['employment_type'].map({
                            'FT': 'Full_Time',
                            'PT': 'Part_Time',
                            'CT': 'Contract',
                            'FL': 'Freelance'
                        })

In [21]:
df2['employment_type'].value_counts()

Full_Time    546
Part_Time     10
Contract       5
Freelance      4
Name: employment_type, dtype: int64

In [22]:
df2.drop(['salary','salary_currency'],axis='columns',inplace=True)

In [23]:
df2.head()

,work_year,experience_level,employment_type,job_title,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2020,Mid,Full_Time,Data Scientist,79833,DE,0,DE,L
1,2020,Senior,Full_Time,Machine Learning Scientist,260000,JP,0,JP,S
2,2020,Senior,Full_Time,Big Data Engineer,109024,GB,50,GB,M
3,2020,Mid,Full_Time,Product Data Analyst,20000,HN,0,HN,S
4,2020,Senior,Full_Time,Machine Learning Engineer,150000,US,50,US,L

In [24]:
df2.shape

(565, 9)

In [25]:
df2['employee_residence'].unique()

array(['DE', 'JP', 'GB', 'HN', 'US', 'HU', 'NZ', 'FR', 'IN', 'PK', 'PL',
       'PT', 'CN', 'GR', 'AE', 'NL', 'MX', 'CA', 'AT', 'NG', 'PH', 'ES',
       'DK', 'RU', 'IT', 'HR', 'BG', 'SG', 'BR', 'IQ', 'VN', 'BE', 'UA',
       'MT', 'CL', 'RO', 'IR', 'CO', 'MD', 'KE', 'SI', 'HK', 'TR', 'RS',
       'PR', 'LU', 'JE', 'CZ', 'AR', 'DZ', 'TN', 'MY', 'EE', 'AU', 'BO',
       'IE', 'CH'], dtype=object)

In [26]:
#converting countries code to its corresponding names for 'employee_residence' and 'company_location'
import pycountry

def convert_country_code_to_name(code):
    try:
        # Look up the country object using the code
        country = pycountry.countries.lookup(code)
        # Return the country name
        return country.name
    except:
        # Return the original code if the lookup fails
        return code

In [27]:
df2['employee_residence'] = df2['employee_residence'].apply(convert_country_code_to_name)
df2['company_location'] = df2['company_location'].apply(convert_country_code_to_name)

In [28]:
df2.head()

,work_year,experience_level,employment_type,job_title,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2020,Mid,Full_Time,Data Scientist,79833,Germany,0,Germany,L
1,2020,Senior,Full_Time,Machine Learning Scientist,260000,Japan,0,Japan,S
2,2020,Senior,Full_Time,Big Data Engineer,109024,United Kingdom,50,United Kingdom,M
3,2020,Mid,Full_Time,Product Data Analyst,20000,Honduras,0,Honduras,S
4,2020,Senior,Full_Time,Machine Learning Engineer,150000,United States,50,United States,L

In [29]:
df2['employee_residence'].value_counts()

United States                      295
United Kingdom                      43
India                               30
Canada                              27
Germany                             24
France                              18
Spain                               15
Greece                              12
Japan                                7
Portugal                             6
Brazil                               6
Pakistan                             6
Netherlands                          5
Poland                               4
Italy                                4
Russian Federation                   4
United Arab Emirates                 3
Austria                              3
Viet Nam                             3
Turkey                               3
Australia                            3
Romania                              2
Belgium                              2
Singapore                            2
Slovenia                             2
Denmark                              2
Hungary                              2
Nigeria                              2
Mexico                               2
Bolivia, Plurinational State of      1
Malaysia                             1
Tunisia                              1
Ireland                              1
Algeria                              1
Argentina                            1
Czechia                              1
Jersey                               1
Luxembourg                           1
Puerto Rico                          1
Serbia                               1
Estonia                              1
Chile                                1
Hong Kong                            1
Kenya                                1
Moldova, Republic of                 1
Colombia                             1
Iran, Islamic Republic of            1
China                                1
Malta                                1
Ukraine                              1
Iraq                                 1
Honduras                             1
Bulgaria                             1
Croatia                              1
Philippines                          1
New Zealand                          1
Switzerland                          1
Name: employee_residence, dtype: int64

In [30]:
df2['company_location'].value_counts()

United States                318
United Kingdom                46
Canada                        28
Germany                       27
India                         24
France                        15
Spain                         14
Greece                        10
Japan                          6
Netherlands                    4
Austria                        4
Portugal                       4
Poland                         4
Luxembourg                     3
Pakistan                       3
Brazil                         3
United Arab Emirates           3
Mexico                         3
Australia                      3
Turkey                         3
Denmark                        3
Italy                          2
Czechia                        2
Slovenia                       2
Russian Federation             2
Switzerland                    2
Nigeria                        2
China                          2
Belgium                        2
Viet Nam                       1
Estonia                        1
American Samoa                 1
Algeria                        1
Malaysia                       1
Moldova, Republic of           1
Kenya                          1
Singapore                      1
Colombia                       1
Iran, Islamic Republic of      1
Chile                          1
Malta                          1
Israel                         1
Ukraine                        1
Iraq                           1
Romania                        1
Croatia                        1
New Zealand                    1
Hungary                        1
Honduras                       1
Ireland                        1
Name: company_location, dtype: int64

In [31]:
df2['company_size'].value_counts()

M    290
L    193
S     82
Name: company_size, dtype: int64

In [32]:
df2['company_size'] = df2['company_size'].map({
                        'M': 'Medium',
                        'L': 'Large',
                        'S': 'Small'
                    })

In [33]:
df2['company_size'].value_counts()

Medium    290
Large     193
Small      82
Name: company_size, dtype: int64

In [34]:
df2['remote_ratio'].value_counts()

100    346
0      121
50      98
Name: remote_ratio, dtype: int64

In [35]:
df2.rename(columns={'remote_ratio': 'job_type'},inplace=True)

In [36]:
df2['job_type'] = df2['job_type'].map({
                    100: 'remote',
                    0: 'onsite',
                    50: 'hybrid'
                    
                  })

In [37]:
df2['job_type'].value_counts()

remote    346
onsite    121
hybrid     98
Name: job_type, dtype: int64

In [39]:
df2['job_title'].value_counts()

Data Scientist                              130
Data Engineer                               121
Data Analyst                                 82
Machine Learning Engineer                    39
Research Scientist                           16
Data Science Manager                         12
Data Architect                               11
Big Data Engineer                             8
Machine Learning Scientist                    8
Principal Data Scientist                      7
AI Scientist                                  7
Data Science Consultant                       7
Director of Data Science                      7
Data Analytics Manager                        7
ML Engineer                                   6
Computer Vision Engineer                      6
BI Data Analyst                               6
Lead Data Engineer                            6
Data Engineering Manager                      5
Business Data Analyst                         5
Head of Data                                  5
Applied Data Scientist                        5
Applied Machine Learning Scientist            4
Head of Data Science                          4
Analytics Engineer                            4
Data Analytics Engineer                       4
Machine Learning Developer                    3
Lead Data Scientist                           3
Computer Vision Software Engineer             3
Data Science Engineer                         3
Principal Data Engineer                       3
Machine Learning Infrastructure Engineer      3
Lead Data Analyst                             3
Cloud Data Engineer                           2
Financial Data Analyst                        2
Director of Data Engineering                  2
Product Data Analyst                          2
Principal Data Analyst                        2
Head of Machine Learning                      1
3D Computer Vision Researcher                 1
NLP Engineer                                  1
Lead Machine Learning Engineer                1
ETL Developer                                 1
Data Specialist                               1
Staff Data Scientist                          1
Big Data Architect                            1
Finance Data Analyst                          1
Marketing Data Analyst                        1
Machine Learning Manager                      1
Data Analytics Lead                           1
Name: job_title, dtype: int64

In [40]:
df2.to_csv('processed_data.csv',index=False)

## Exploratory Data Analysis